tutorials/pM4F-Benchmarks/case1/calciteDiss_ThermEqPap/dt0_75/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1; //1e-5;

/*
lx 588;
ly -218.2384;
lz  1;
*/

//(-0.090926 -0.0363603 -0.002) (0.0978846 0.0387419 0.002)

lx0 0;
ly0 0;
lz0 0;

lx 0.5;
ly 0.1;
lz 0.1;



vertices 
(
    ($lx0 	$ly0 	$lz0)
    ($lx 	$ly0 	$lz0)
    ($lx 	$ly 	$lz0)
    ($lx0 	$ly 	$lz0)
    ($lx0 	$ly0 	$lz)
    ($lx 	$ly0 	$lz)
    ($lx 	$ly 	$lz)
    ($lx0 	$ly 	$lz)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7)  (50 1 1) simpleGrading (1 1 1)  // (20 20 20) 
);

edges           
(
);

//patches  
boundary       
(

    outlet
	{
		type patch; //cyclic;
		faces
		(
        (2 6 5 1)
		);
//		neighbourPatch left;
	}

    inlet
	{
		type patch; //cyclic;
		faces
		(
        (0 4 7 3)
		);
//		neighbourPatch right;
	}

    frontAndBack
	{
		type empty;
		faces
		(
		    (3 7 6 2)
		    (1 5 4 0)
		    (0 3 2 1)
		    (4 5 6 7)
		);
	}

);

mergePatchPairs 
(
);


// ************************************************************************* //
